package menu;

public class ReferenceView {
    public static void viewReference() {
        System.out.println("\nСправка о программе:");
        System.out.println("Данная программа Описать класс, реализующий тип данных «вещественная матрица» и работу с ними. \n" +
                "Методы класса обеспечивают:\n" +
                "\n" +
                "1.) сложение, вычитание, умножение матриц (умножение, как на другую матрицу, так и на число);\n" +
                "\n" +
                "2.) вычисление транспонированной матриц;\n" +
                "\n" +
                "3.) проверку типа матрицы (квадратная, диагональная, нулевая, единичная)\n");
    }
}
